[
  {
    "id": "project1",
    "title": "Parkefficient",
    "role": "Senior Full-Stack Developer",
    "description": "Developed a comprehensive, cloud-based platform for the digital management of parking spaces. The solution includes an intelligent app for employee parking (ParkEfficient) and a central control hub for property management (AssetOS). Implemented features such as digital access control (QR codes, license plate recognition), real-time data analysis, and automated billing. The platform is designed for seamless integration into existing infrastructure via APIs.",
    "tech": ["Laravel", "Vue.js", "Filament", "REST API", "Leaflet", "SAML SSO"],
    "image": "images/pe.png",
    "link": "https://parkefficient.de"
  },
  {
    "id": "project2",
    "title": "OfficeEfficient",
    "role": "Senior Full-Stack Developer",
    "description": "Developed a desk-sharing software for booking workspaces, conference rooms, and parking spaces. The platform offers a central dashboard for data analysis on office usage and seamless integrations with Microsoft Office 365, Teams, and other calendar systems. The focus was on data security, scalability, and intuitive user experience.",
    "tech": ["Laravel", "Vue.js", "Filament", "REST API", "Microsoft 365 APIs"],
    "image": "images/oe.png",
    "link": "https://officeefficient.de"
  },
  {
    "id": "project3",
    "title": "Linear Flächenheizung Schnellauslegung",
    "role": "Software Developer",
    "description": "Redesigned a Building Information Modeling (BIM) web application from Ruby to the MERN stack. I was solely responsible for the architecture, development, and testing of the new system, implementing Redis for intensive calculations, which resulted in significant performance improvements.",
    "tech": ["React.js", "Node.js", "Express.js", "MongoDB", "Redis", "BIM"],
    "image": "https://dummyimage.com/300x200/374151/22d3ee&text=Linear",
    "link": "https://www.ivt-flaechenheizung-schnellauslegung.de"
  },
  {
    "id": "project4",
    "title": "Exultec.net",
    "role": "Full-Stack Developer",
    "description": "Developed a custom business process management software for shift planning, capacity pooling, and automated contract management. Engineered Angular frontend modules and used LoopBack for REST APIs. I also built an invoice claim mobile application using Ionic.",
    "tech": ["Angular", "LoopBack", "Ionic", "REST API"],
    "image": "images/exultec.png",
    "link": "https://exultec.net/"
  },
  {
    "id": "project5",
    "title": "Zweirat – Beratung & Training",
    "role": "Development & DevOps",
    "description": "Built a corporate WordPress website for a consulting and training company. The site features information on workshops, media training, and coaching, and includes a client reference section. The project focused on creating a clear, easy-to-navigate platform to showcase the company's services and expertise.",
    "tech": ["WordPress", "PHP", "HTML", "CSS", "JavaScript"],
    "image": "https://dummyimage.com/300x200/374151/22d3ee&text=Zweirat",
    "link": "https://zweirat.de"
  },
  {
    "id": "project_mma",
    "title": "Malaysian Medical Association Website",
    "role": "Development",
    "description": "The Malaysian Medical Association (MMA) serves as the largest representative body of doctors in Malaysia. Their official website provides a portal for membership registration, professional resources, publications, continuing medical education (CPD), ethical guidance, event information, and organizational announcements.",
    "tech": ["Membership Portal", "Public Resources"],
    "image": "https://dummyimage.com/300x200/374151/22d3ee&text=MMA",
    "link": "https://mma.org.my"
  },
  {
    "id": "project_vitcomex",
    "title": "Vitcomex – Remittance Management System",
    "role": "Development",
    "description": "Vitcomex, a remittance agent for CIMB Bank, implemented a comprehensive Remittance Management System. This platform supports branch and online transactions from initiation to payout, including recording, categorizing, analysis, detailed financial reporting and receipt generation, featuring robust reporting modules like Trial Balance, P&L, Ledger, Commission Reports, and more.",
    "tech": ["PHP Yii", "MVC", "Financial Reporting"],
    "image": "https://dummyimage.com/300x200/374151/22d3ee&text=Vitcomex",
    "link": "https://www.goodcore.co.uk/cases/remittance-management-software/"
  }
]