[
  {
    "id": "project1",
    "title": "ParkEfficient – Parking & Asset Management",
    "role": "Senior Full-Stack Developer",
    "outcome_highlight": "Built optimization features and connected multiple cloud APIs for real-time hardware control and smarter resource use.",
    "description": "As a senior developer, I worked across the stack to build and grow this platform. I developed the admin dashboard (AssetOS) with Filament and implemented core logic for the user app, including series bookings, analytics, and interactive maps with Leaflet.js. A big focus was on optimizing resources through contingent sharing/pooling and integrating third-party APIs. This included live barrier control with the Scheidt & Bachmann (entervo) API and EV charging data via ChargeX.",
    "tech": ["Laravel", "Filament", "Vue.js", "Leaflet.js", "Scheidt & Bachmann API", "ChargeX API", "IoT Integration", "SAML SSO"],
    "image": "images/pe.png",
    "link": "https://parkefficient.de"
  },
  {
    "id": "project2",
    "title": "OfficeEfficient – Workspace Management",
    "role": "Senior Full-Stack Developer",
    "outcome_highlight": "Built the main admin dashboard and data visualization engine for a full workspace management solution.",
    "description": "I worked on both the backend and frontend to shape this platform. My role included building the admin dashboard with Filament and implementing core features for the user app, such as series bookings, activity logs, and resource maps with Leaflet.js. I also focused on utility optimization by adding sharing and pooling logic, and integrated external APIs to meet client requirements.",
    "tech": ["Laravel", "Filament", "Vue.js", "Leaflet.js", "Data Visualization", "REST API", "SAML SSO", "MariaDB"],
    "image": "images/oe.png",
    "link": "https://officeefficient.de"
  },
  {
    "id": "project3",
    "title": "Linear – Heating Design BIM Tool",
    "role": "Software Developer",
    "outcome_highlight": "Rebuilt a BIM web app on the MERN stack, boosting performance with a modern backend architecture.",
    "description": "I led the backend migration of this Building Information Modeling (BIM) app from Ruby/Sinatra to the MERN stack. My responsibilities included backend architecture, Node.js/Express development, database design, and testing. I also introduced Redis to handle heavy calculations, which significantly improved speed. The frontend was developed in React.js by a teammate.",
    "tech": ["MERN Stack", "Redis", "BIM", "Ruby", "Sinatra"],
    "image": "images/linear.png",
    "link": "https://www.ivt-flaechenheizung-schnellauslegung.de"
  },
  {
    "id": "project4",
    "title": "Exultec.net – BPM Software",
    "role": "Full-Stack Developer",
    "outcome_highlight": "Developed core modules for a custom business process management system.",
    "description": "As part of the development team, I worked on both frontend and backend. On the frontend, I built Angular modules, while on the backend I developed REST APIs with LoopBack. My work powered features like shift planning, capacity pooling, and automated contract management. I also built a mobile invoice claim app using Ionic.",
    "tech": ["Angular 5", "LoopBack", "MySQL", "Typescript", "Ionic", "REST API", "Material UI"],
    "image": "images/exultec.png",
    "link": "https://exultec.net/"
  },
  {
    "id": "project_vitcomex",
    "title": "Vitcomex – Remittance Management System",
    "role": "Data Analytics Specialist",
    "outcome_highlight": "Turned complex remittance data into clear reports and insights for a national financial service provider.",
    "description": "I supported the development of a Remittance Management System by focusing on financial reporting and analytics. My work included advanced SQL queries to extract and process transaction data, and creating visualizations for reports such as profit & loss, balance sheets, and commission summaries.",
    "tech": ["PHP", "MySQL", "jQuery"],
    "image": "images/vitcomex.png",
    "link": "https://www.goodcore.co.uk/cases/remittance-management-software/"
  },
  {
    "id": "project_inhouse",
    "title": "RelACS – SIRVA",
    "role": "Software Engineer",
    "outcome_highlight": "Helped digitize relocation workflows by maintaining and extending a custom operations platform.",
    "description": "I worked on maintaining and enhancing a web application designed to replace manual Excel and Word processes for relocation management. My responsibilities included resolving technical issues, supporting daily operations, and building new features to manage client data and track relocation progress more effectively.",
    "tech": ["SQL Server", "JavaScript"],
    "image": "images/relacs.png",
    "link": "https://www.goodcore.co.uk/cases/relocation-management-system/"
  }
]
